In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('C:/Users/User1/Downloads/StudentsPerformance.csv')
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# To find out how many males and females participated in the test

In [4]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# Students parental level of education

In [5]:
print(df['parental level of education'])

0        some high school
1             high school
2        some high school
3            some college
4            some college
              ...
995          some college
996          some college
997          some college
998    associate's degree
999     bachelor's degree
Name: parental level of education, Length: 1000, dtype: object

In [6]:
df["parental level of education"].mode()

0    some college
dtype: object

In [ ]:
most of the students parental level of education shows some college

# who scores the most on average for math, reading and writing based on Gender

In [7]:
df.groupby('gender')['math score','reading score','writing score'].mean()

C:\Users\User1\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

# who scores the most on average for math, reading and writing based on test preparation course

In [12]:
df.groupby('test preparation course')['math score','reading score','writing score'].mean()

C:\Users\User1\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

# scoring variation for math, reading and writing based on gender

In [22]:
df.groupby('gender')['math score','reading score','writing score'].var()

C:\Users\User1\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

# scoring variation for math, reading and writing based on test preparation course

In [23]:
df.groupby('test preparation course')['math score','reading score','writing score'].var()

C:\Users\User1\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [18]:
print(df.var())

math score       242.411410
reading score    216.279254
writing score    231.842682
dtype: float64

# top 25% students based on math score

In [20]:
data=df.groupby(['math score']).max()

In [16]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,reading score,writing score
math score,,,,,,,
0,female,group C,some high school,free/reduced,none,17,10
8,female,group B,high school,free/reduced,none,24,23
11,female,group B,some college,standard,none,38,32
13,female,group C,some high school,free/reduced,none,41,51
18,female,group B,some high school,free/reduced,none,32,28
...,...,...,...,...,...,...,...
96,male,group C,bachelor's degree,standard,completed,100,100
97,male,group E,some high school,standard,none,100,100
98,male,group D,some college,standard,none,100,99
99,male,group E,some college,standard,none,100,100
100,male,group E,some college,standard,none,100,100